-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 18, 2023 at 02:53 AM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `needsapp`
--

-- --------------------------------------------------------

--
-- Table structure for table `classes`
--

CREATE TABLE `classes` (
  `id` int(11) DEFAULT NULL,
  `class` varchar(14) DEFAULT NULL,
  `level` varchar(18) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `classes`
--

INSERT INTO `classes` (`id`, `class`, `level`) VALUES
(1, 'KG 1', 'رياض الأطفال'),
(2, 'KG 2', 'رياض الأطفال'),
(3, 'KG 3', 'رياض الأطفال'),
(4, 'الصف الأول', 'المرحلة الابتدائية'),
(5, 'الصف الثاني', 'المرحلة الابتدائية'),
(6, 'الصف الثالث', 'المرحلة الابتدائية'),
(7, 'الصف الرابع', 'المرحلة الابتدائية'),
(8, 'الصف الخامس', 'المرحلة الابتدائية'),
(9, 'الصف السادس', 'المرحلة الابتدائية'),
(10, 'الأول المتوسط', 'المرحلة المتوسطة'),
(11, 'الثاني المتوسط', 'المرحلة المتوسطة'),
(12, 'الثالث المتوسط', 'المرحلة المتوسطة'),
(13, 'الأول الثانوي', 'المرحلة الثانوية'),
(14, 'الثاني الثانوي', 'المرحلة الثانوية'),
(15, 'الثالث الثانوي', 'المرحلة الثانوية');

-- --------------------------------------------------------

--
-- Table structure for table `compounds`
--

CREATE TABLE `compounds` (
  `id` int(11) NOT NULL,
  `compound` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `compounds`
--

INSERT INTO `compounds` (`id`, `compound`) VALUES
(1, 'مدارس المتقدمة - حي العارض'),
(2, 'مجمع المتقدمة الأهلي والعالمي فرع منطقة الجوف'),
(3, 'مدارس المتقدمة - حي الملقا'),
(4, 'مجمع التضامن التعليمي-حي عليشة'),
(5, 'مجمع شروق المتقدمة التعليمي - فرع الأحساء'),
(6, 'مجمع المتقدمة التعليمي - فرع القادسية'),
(7, 'مجمع الجامعة التطبيقية التعليمي - فرع المونسية'),
(8, 'مجمع المطورون التعليمي - ضاحية لبن'),
(9, 'مجمع علوم الرياض التعليمي - فرع الخليج'),
(10, 'مجمع رواد الابداع التعليمي - فرع البديعة'),
(11, 'مجمع المتقدمة للتعلم الذكي - فرع المغرزات'),
(12, 'مجمع علوم الرياض التعليمي - فرع الصحافة'),
(13, 'مجمع نيار التعليمي - فرع الربيع'),
(14, 'مجمع الابتكارية 1 التعليمي - فرع الملك فيصل'),
(15, 'مجمع الابتكارية 2 التعليمي - فرع اشبيلية'),
(16, 'مجمع المتقدمة التعليمي - فرع العقيق'),
(17, 'مجمع الأمجاد التعليمي - فرع الحمراء'),
(18, 'مجمع الأمجاد التعليمي - حي الحمراء'),
(19, 'مجمع آفاق التعليم التعليمي - فرع الأحساء'),
(20, 'مدارس المتقدمة - حي حطين'),
(21, 'مجمع مدارس الرائد العالمية - حي الوادي'),
(22, 'مجمع المتقدمة التعليمي - فرع النهضة'),
(23, 'مجمع المطورون التعليمي - فرع الخرج'),
(24, 'مجمع المتقدمة التعليمي - فرع جامعة الملك فيصل'),
(25, 'مجمع المتقدمة التعليمي - فرع المصيف'),
(26, 'مجمع المتقدمة التعليمي - فرع عليشة'),
(27, 'مجمع المتقدمة التعليمي - فرع النزهه'),
(28, 'مجمع المتقدمة التعليمي - بحي النزهة'),
(29, 'مجمع التضامن التعليمي - فرع عليشة'),
(30, 'مجمع الرائد التعليمي - فرع الوادي'),
(31, 'مجمع المتقدمة التعليمي - فرع حطين'),
(32, 'مجمع الامجاد التعليمي - فرع الشهداء'),
(33, 'مجمع المتقدمة التعليمي - فرع النرجس'),
(34, 'مجمع المطورون - ضاحية لبن'),
(35, 'مجمع التضامن التعليمي - فرع عليشة');

-- --------------------------------------------------------

--
-- Table structure for table `genders`
--

CREATE TABLE `genders` (
  `id` int(11) NOT NULL,
  `gender` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `genders`
--

INSERT INTO `genders` (`id`, `gender`) VALUES
(1, 'بنين'),
(2, 'بنات');

-- --------------------------------------------------------

--
-- Table structure for table `levels`
--

CREATE TABLE `levels` (
  `id` int(11) NOT NULL,
  `level` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `levels`
--

INSERT INTO `levels` (`id`, `level`) VALUES
(1, 'رياض الأطفال'),
(2, 'المرحلة الابتدائية'),
(3, 'المرحلة المتوسطة'),
(4, 'المرحلة الثانوية');

-- --------------------------------------------------------

--
-- Table structure for table `needs`
--

CREATE TABLE `needs` (
  `id` int(11) NOT NULL,
  `compound` varchar(191) NOT NULL,
  `path` varchar(191) NOT NULL,
  `level` varchar(191) NOT NULL,
  `class` varchar(191) NOT NULL,
  `gender` varchar(191) NOT NULL,
  `subjects` varchar(2000) NOT NULL,
  `comple` varchar(191) NOT NULL,
  `need_code` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `needs`
--

INSERT INTO `needs` (`id`, `compound`, `path`, `level`, `class`, `gender`, `subjects`, `comple`, `need_code`) VALUES
(52, 'مجمع الأمجاد التعليمي - فرع الحمراء', 'الدبلوما الأمريكية', 'المرحلة الابتدائية', '', 'بنين', '', '25', '17-4-2-1'),
(54, 'مجمع الأمجاد التعليمي - فرع الحمراء', 'التحفيظ', 'رياض الأطفال', '', 'بنات', '', '25', '17-2-1-2');

-- --------------------------------------------------------

--
-- Table structure for table `paths`
--

CREATE TABLE `paths` (
  `id` int(11) NOT NULL,
  `path` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `paths`
--

INSERT INTO `paths` (`id`, `path`) VALUES
(1, 'العام'),
(2, 'التحفيظ'),
(3, 'الدولي'),
(4, 'الدبلوما الأمريكية'),
(5, 'المصري');

-- --------------------------------------------------------

--
-- Table structure for table `sections`
--

CREATE TABLE `sections` (
  `id` int(11) NOT NULL,
  `sub_name` varchar(100) NOT NULL,
  `sub_bg` varchar(100) NOT NULL,
  `font_color` varchar(100) NOT NULL,
  `sub_icon` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `sections`
--

INSERT INTO `sections` (`id`, `sub_name`, `sub_bg`, `font_color`, `sub_icon`) VALUES
(1, 'المجمعات', '0a8f74', 'fff', 'fa fa-sitemap text-white'),
(2, 'المسارات', '65c7d0', '2a3f54', 'fa fa-id-badge text-dark'),
(3, 'التخصصات', '038995', 'fff', 'fas fa-book text-white'),
(4, 'المعلمون', 'f7921e', '2a3f54', 'fa fa-user text-dark'),
(5, 'المواد الدراسية', 'ef4b28', 'fff', 'fas fa-address-book text-white'),
(6, 'الاحتياجات', 'a4c92c', '2a3f54', 'fas fa-id-card text-dark');

-- --------------------------------------------------------

--
-- Table structure for table `specs`
--

CREATE TABLE `specs` (
  `id` int(11) NOT NULL,
  `spec` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `specs`
--

INSERT INTO `specs` (`id`, `spec`) VALUES
(1, 'رياضيات'),
(2, 'لغة عربية'),
(3, 'شريعة'),
(4, 'فيزياء'),
(5, 'تربية بدنية'),
(6, 'لغة انجليزية'),
(7, 'أحياء'),
(8, 'تاريخ'),
(9, 'تربية فنية '),
(10, 'حاسب'),
(11, 'جغرافيا'),
(12, 'إعلام تربوي'),
(13, 'فيزياء وكيمياء '),
(14, 'علم نفس'),
(15, 'لغة فرنسية '),
(16, 'لغة ألمانية'),
(17, 'كيمياء'),
(18, 'علم اجتماع'),
(19, 'أصول دين'),
(20, 'وثائق ومكتبات'),
(21, 'صعوبات تعلم'),
(22, 'تربية خاصة'),
(23, 'صحافة ونشر'),
(24, 'علم اجتماع'),
(25, 'التاريخ و الحضارة'),
(26, 'علوم بيولوجية'),
(27, 'تكنولوجيا تعليم');

-- --------------------------------------------------------

--
-- Table structure for table `subjects`
--

CREATE TABLE `subjects` (
  `id` int(11) NOT NULL,
  `subject` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `subjects`
--

INSERT INTO `subjects` (`id`, `subject`) VALUES
(1, 'اللغة العربية'),
(2, 'الدراسات الإسلامية'),
(3, 'اللغة الإنجليزية'),
(4, 'العلوم'),
(5, 'الرياضيات'),
(6, 'التربية البدنية'),
(7, 'التربية الفنية'),
(8, 'المهارات الرقمية'),
(9, 'المهارات الحياتية'),
(10, 'التفكير الناقد'),
(11, 'الاجتماعيات'),
(12, 'الكيمياء'),
(13, 'الفيزياء'),
(14, 'الأحياء'),
(15, 'علم البيئة'),
(16, 'العلوم الإدارية'),
(17, 'نور البيان'),
(18, 'الروبوت'),
(19, 'الكابستون'),
(20, 'الذكاء الاصطناعي'),
(21, 'اللغة الفرنسية'),
(22, 'اللغة الألمانية'),
(23, 'الجيولوجيا'),
(24, 'التربية الأسرية'),
(25, 'القدرات اللفظية'),
(26, 'القدرات الكمية'),
(27, 'التحصيلي');

-- --------------------------------------------------------

--
-- Table structure for table `subject_need`
--

CREATE TABLE `subject_need` (
  `id` int(11) NOT NULL,
  `subject` varchar(191) NOT NULL,
  `n_code` varchar(191) NOT NULL,
  `c_code` varchar(191) NOT NULL,
  `l_number` varchar(191) NOT NULL,
  `c_number` varchar(191) NOT NULL,
  `total_no` varchar(191) NOT NULL,
  `need_no` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `subject_need`
--

INSERT INTO `subject_need` (`id`, `subject`, `n_code`, `c_code`, `l_number`, `c_number`, `total_no`, `need_no`) VALUES
(1, 'التربية الأسرية', '52', '4', '3', '7', '21', '0.84'),
(2, 'الجيولوجيا', '52', '4', '7', '2', '14', '0.56'),
(3, 'التربية الأسرية', '52', '5', '3', '2', '6', '0.24'),
(4, 'التربية الفنية', '52', '5', '7', '3', '21', '0.84'),
(5, 'الدراسات الإسلامية', '54', '1', '5', '2', '10', '0.40'),
(6, 'الذكاء الاصطناعي', '54', '1', '4', '2', '8', '0.32'),
(7, 'التربية البدنية', '54', '1', '2', '2', '4', '0.16'),
(8, 'التربية البدنية', '54', '2', '3', '2', '6', '0.24'),
(9, 'الاجتماعيات', '54', '2', '5', '2', '10', '0.40'),
(10, 'القدرات اللفظية', '54', '3', '4', '2', '8', '0.32'),
(11, 'الدراسات الإسلامية', '54', '3', '3', '2', '6', '0.24');

-- --------------------------------------------------------

--
-- Table structure for table `teachers`
--

CREATE TABLE `teachers` (
  `id` int(11) NOT NULL,
  `name` varchar(191) NOT NULL,
  `nationality` varchar(191) NOT NULL,
  `speciality` varchar(191) NOT NULL,
  `level` varchar(191) NOT NULL,
  `subject1` varchar(191) NOT NULL,
  `subject2` varchar(191) NOT NULL,
  `subject3` varchar(191) NOT NULL,
  `clsNumber1` varchar(191) NOT NULL,
  `clsNumber2` varchar(191) NOT NULL,
  `clsNumber3` varchar(191) NOT NULL,
  `comple` varchar(191) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `teachers`
--

INSERT INTO `teachers` (`id`, `name`, `nationality`, `speciality`, `level`, `subject1`, `subject2`, `subject3`, `clsNumber1`, `clsNumber2`, `clsNumber3`, `comple`) VALUES
(45, 'Wael Amri', 'فلسطيني', 'تكنولوجيا تعليم', 'متوسطة,ثانوية', 'الذكاء الاصطناعي', 'الروبوت', '', '22', '17', '0', '39'),
(46, 'ابراهيم ابراهيم الجوهري أبو سمرة', 'مصري', 'رياضيات', 'الابتدائية', 'رياضيات', '', '', '', '', '', '26'),
(47, 'ابراهيم اسماعيل حسين حميد', 'مصري', 'لغة عربية', 'الابتدائية', 'صفوف أولية', '', '', '', '', '', '20'),
(48, 'سلام معروف دياب معروف', 'مصري', 'لغة عربية', 'الابتدائية', 'صفوف أولية', '', '', '', '', '', '24'),
(49, 'أحمد السيد عبد اللطيف جاد', 'مصري', 'شريعة', 'مسار مصري', 'صفوف أولية', '', '', '', '', '', '24'),
(50, 'أيمن محمود عبد القادر قابيل', 'مصري', 'فيزياء', 'الابتدائية', 'علوم', '', '', '', '', '', '22'),
(51, 'سامح حنفي رفاعي حنفي', 'مصري', 'لغة عربية', 'الابتدائية', 'صفوف أولية', '', '', '', '', '', '25'),
(52, 'طاهر عبد الهادي عويس محمد', 'مصري', 'تربية بدنية', 'الابتدائية', 'بدنية', '', '', '', '', '', '24'),
(53, 'محمد صابر ابو الخير خالد راشد ', 'مصري', 'لغة عربية', 'الابتدائية', 'لغة عربية', '', '', '', '', '', '25'),
(54, 'حسين مسعود محمود ', 'مصري', 'لغة عربية', 'الثانوية', 'لغة عربية', '', '', '', '', '', '19'),
(55, 'محمود علي فاضل غندور', 'مصري', 'شريعة', 'الابتدائية', 'صفوف أولية', '', '', '', '', '', '27'),
(56, 'نبيل شعبان احمد ابو العينين', 'مصري', 'لغة انجليزية', 'مسار مصري', 'لغة انجليزية', '', '', '', '', '', '25'),
(57, 'يحيى زكريا ابو المعاطي محمد', 'مصري', 'لغة عربية', 'مسار مصري', 'صفوف أولية', '', '', '', '', '', '24'),
(58, 'عز الدين يوسف محمد فضل الله', 'سوداني', 'لغة عربية', 'الابتدائية', 'صفوف أولية', '', '', '', '', '', '25'),
(59, 'كريم مصطفي احمد', 'مصري', 'رياضيات', 'الابتدائية', 'رياضيات', '', '', '', '', '', '24'),
(60, 'الاسعد صالح محمد البرهومي', 'تونسي', 'أحياء', 'المتوسطة', 'علوم', '', '', '', '', '', '24'),
(61, 'محمد وحيد عبد العزيز ', 'مصري ', 'لغة عربية ', 'المتوسطة', 'لغة عربية ', '', '', '', '', '', '24'),
(62, 'محمد عبد رب الرسول  موسى', 'مصري ', 'لغة عربية ', 'مسار مصري', 'معلم لغة عربية', '', '', '', '', '', '26'),
(63, 'محمود السايح عبد العظيم السايح', 'مصري ', 'فيزياء', 'الثانوية', 'فيزياء', '', '', '', '', '', '20'),
(64, 'محمد بابكر حسين عالم', 'سوداني', 'لغة انجليزية ', 'الثانوية', 'اللغة انجليزية', '', '', '', '', '', '20'),
(65, 'عبد اللطيف محمد العمري', 'سعودي', 'شريعة', 'الابتدائية', 'اسلاميات', '', '', '', '', '', '14'),
(66, 'بسام رشيد العمروسي السبوعي', 'تونسي', 'أحياء', 'الابتدائية', 'علوم', '', '', '', '', '', '24'),
(67, 'محمد سعيد محمد حافظ ', 'مصري ', 'تاريخ', 'مسار مصري', 'اجتماعيات / وطنية', '', '', '', '', '', '16'),
(68, 'علي فرج الجبالي ', 'تونسي', 'تربية فنية ', 'الابتدائية', 'فنية', '', '', '', '', '', '26'),
(69, 'حسن إسماعيل حسين حميد', 'مصري ', 'لغة انجليزية', 'الابتدائية', 'لغة انجليزية ', '', '', '', '', '', '25'),
(70, 'محمد شريف السعيد', 'مصري', 'حاسب', 'الثانوية', 'تقنية رقمية', '', '', '', '', '', '23'),
(71, 'إبراهيم محمد القطب', 'مصري', 'تربية بدنية', 'مسار مصري', 'بدنية', '', '', '', '', '', '27'),
(72, 'بكري إبراهيم السيد', 'مصري', 'جغرافيا', 'الثانوية', 'اجتماعيات / تربية مهنية', '', '', '', '', '', '20'),
(73, 'حسام الدين المحمودي ', 'مصري', 'تاريخ', 'مسار مصري', 'مهارات / مكتبة', '', '', '', '', '', '26'),
(74, 'محمد محمود احمد محمود', 'مصري', 'شريعة', 'المتوسطة', 'إسلامية', '', '', '', '', '', '25'),
(75, 'خباب عبد النور عبد المنعم عطية', 'مصري', 'لغة عربية ', 'مسار مصري', 'لغة عربية ', '', '', '', '', '', '24'),
(76, 'عاطف مصطفى ابراهيم محمد', 'مصري', 'رياضيات ', 'المتوسطة', 'رياضيات ', '', '', '', '', '', '24'),
(77, 'محمد احمد محمود الشيخ', 'مصري', 'تاريخ', 'مسار مصري', 'دراسات', '', '', '', '', '', '24'),
(78, 'محمد جلال عبد المعبود بسيوني', 'مصري', 'لغة انجليزية ', 'مسار مصري', 'لغة انجليزية ', '', '', '', '', '', '26'),
(79, 'حسن السيد محمود زهرة ', 'مصري', 'لغة عربية ', 'مسار مصري', 'إسلامية', '', '', '', '', '', '26'),
(80, 'إيهاب نصر الدين مكي ', 'مصري', 'إعلام تربوي', 'المتوسطة', 'تربية فنية', '', '', '', '', '', '24'),
(81, 'أحمد الحسيني السيد الرشيدي', 'مصري', 'رياضيات', 'الثانوية', 'رياضيات', '', '', '', '', '', '25'),
(82, 'أشرف جلال إبراهيم عثمان', 'مصري', 'رياضيات', 'الثانوية', 'رياضيات', '', '', '', '', '', '20'),
(83, 'محمد عبد النبي مصطفى ', 'مصري', 'رياضيات ', 'مسار مصري', 'رياضيات', '', '', '', '', '', '26'),
(84, 'بدر سعد بدر عبده', 'مصري', 'إنجليزي', 'الثانوية', 'إنجليزي', '', '', '', '', '', '24'),
(85, 'مسعد عوض إبراهيم', 'مصري', 'فيزياء وكيمياء ', 'الثانوية', 'كيمياء', '', '', '', '', '', '25'),
(86, 'محمد فؤاد عبد الله فايد', 'مصري', 'لغة عربية ', 'مسار مصري', 'لغة عربية ', '', '', '', '', '', '26'),
(87, 'محمد محمود محمد طه', 'مصري', 'تربية فنية ', 'مسار مصري', 'فنية', '', '', '', '', '', '24'),
(88, 'محمد ناجي عبد العزيز', 'مصري', 'لغة عربية ', 'مسار مصري', 'لغة عربية ', '', '', '', '', '', '24'),
(89, 'محمود ابراهيم السيد شمس الدين', 'مصري', 'رياضيات ', 'مسار مصري', 'رياضيات ', '', '', '', '', '', '24'),
(90, 'محمود فوزي نجيب عبد العال ', 'مصري', 'لغة انجليزية ', 'مسار مصري', 'لغة انجليزية ', '', '', '', '', '', '26'),
(91, 'محمود محمد الغريب بدر', 'مصري', 'لغة انجليزية ', 'مسار مصري', 'لغة انجليزية ', '', '', '', '', '', '24'),
(92, 'حسام الدين عبد الرزاق الحمروني ', 'تونسي', 'لغة انجليزية ', 'المتوسطة', 'لغة انجليزية', '', '', '', '', '', '24'),
(93, 'محمد عبد الكريم منصور  ', 'مصري', 'لغة عربية', 'مسار مصري', 'نور البيان ', '', '', '', '', '', '24'),
(94, 'مصطفى اسماعيل محمد موسى', 'مصري', 'فيزياء وكيمياء ', 'مسار مصري', 'فيزياء وكيمياء ', '', '', '', '', '', '26'),
(95, 'وليد فهمي زكي احمد', 'مصري', 'أحياء', 'مسار مصري', 'احياء + علوم', '', '', '', '', '', '26'),
(96, 'وليد محمد نور الدين حسن محمد ', 'مصري', 'لغة انجليزية ', 'مسار مصري', 'لغة انجليزية ', '', '', '', '', '', '26'),
(97, 'سعد محمد حسونه', 'مصري', 'رياضيات', 'الثانوية', 'رياضيات', '', '', '', '', '', '26'),
(98, 'امجد عزت عبد المنعم عفيفي', 'مصري', 'لغة فرنسية ', 'مسار مصري', 'فرنسي', '', '', '', '', '', '22'),
(99, 'توفيق شعبان توفيق عويس', 'مصري', 'لغة عربية ', 'مسار مصري', 'لغة عربية ', '', '', '', '', '', '25'),
(100, 'جمال الدين بدوي محمد بدوي الملا', 'مصري', 'رياضيات ', 'مسار مصري', 'رياضيات ', '', '', '', '', '', '25'),
(101, 'جمال محمد عبد الفتاح عمارة', 'مصري', 'لغة ألمانية', 'مسار مصري', 'علوم + الماني', '', '', '', '', '', '22'),
(102, 'محمد إبراهيم عبدالمقصود', 'مصري', 'كيمياء', 'الثانوية', 'كيمياء', '', '', '', '', '', '25'),
(103, 'السيد مصطفى السيد عيد', 'مصري', 'تربية بدنية', 'مسار مصري', 'بدنية', '', '', '', '', '', '24'),
(104, 'وائل العمري المولودي', 'تونسي', 'حاسب', 'مسار مصري', 'حاسب', '', '', '', '', '', '10'),
(105, 'محمد السعيد السعيد هزاع', 'مصري', 'حاسب', 'مسار مصري', 'حاسب', '', '', '', '', '', '26'),
(106, 'احمد محمد احمد ابراهيم', 'مصري', 'وثائق ومكتبات', 'الابتدائية', 'صفوف أولية', '', '', '', '', '', '20'),
(107, 'نبيل الودري محمد سماري', 'تونسي', 'لغة انجليزية', 'الابتدائية', 'لغة انجليزية', '', '', '', '', '', '25'),
(108, 'رضوان محمد نجيب محمد رضوان', 'مصري ', 'رياضيات ', 'مسار مصري', 'رياضيات', '', '', '', '', '', '27'),
(109, 'احمد محمد حسن الروبي ', 'مصري', 'تربية فنية ', 'مسار مصري', 'تربية فنية', '', '', '', '', '', '22'),
(110, 'حسن السيد عبد القادر محمد', 'مصري', 'لغة ألمانية', 'مسار مصري', 'لغة ألمانية', '', '', '', '', '', '22'),
(111, 'محمد عبد العليم خالد علي', 'مصري', 'لغة فرنسية ', 'مسار مصري', 'لغة فرنسية', '', '', '', '', '', '22'),
(112, 'محمد علاء فريد أبو شادي', 'مصري', 'فيزياء', 'الابتدائية', 'فيزياء', '', '', '', '', '', '25'),
(113, 'حسام منصور عبد الحميد', 'مصري', 'أحياء', 'الثانوية', 'أحياء', '', '', '', '', '', '26'),
(114, 'محمد سالم الدوسري', 'سعودي', 'شريعة', 'المتوسطة', 'تربية إسلامية', '', '', '', '', '', '5'),
(115, 'عبد العزيز بن فهد الودعاني', 'سعودي', 'شريعة', 'الابتدائية', 'تربية إسلامية', '', '', '', '', '', '25'),
(116, 'محمد يحيى إبراهيم اليحيى', 'سعودي', 'شريعة', 'الثانوية', 'تربية إسلامية', '', '', '', '', '', '25'),
(117, 'يزيد صالح البشيري الزهراني', 'سعودي', 'التاريخ و الحضارة', 'المتوسطة', 'اجتماعيات', '', '', '', '', '', '22'),
(118, 'محمد احمد عبد الحميد', 'مصري', 'علوم بيولوجية', 'مسار مصري', 'علوم + أحياء', '', '', '', '', '', '25'),
(119, 'ربيع محمد عبد الرحمن عبد القوي', 'مصري', 'رياضيات', 'الابتدائية', 'رياضيات', '', '', '', '', '', '24'),
(120, 'محمد فهد السبيعي', 'سعودي', 'شريعة', 'الابتدائية', 'تربية إسلامية', '', '', '', '', '', '26'),
(121, 'أيمن رجب أحمد عرفة', 'مصري', 'تكنولوجيا تعليم', 'المتوسطة', 'تقنية رقمية', '', '', '', '', '', '24'),
(122, 'نواف محمد الغامدي', 'سعودي', 'تربية بدنية', 'الثانوية', 'بدنية', '', '', '', '', '', '24'),
(123, 'فهد عبد الله عسل الدوسري', 'سعودي', 'شريعة', 'المتوسطة', 'دراسات إسلامية', '', '', '', '', '', '25'),
(124, 'مناحي عيد القحطاني', 'سعودي', 'شريعة', 'الثانوية', 'دراسات إسلامية', '', '', '', '', '', '22');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(191) NOT NULL,
  `email` varchar(191) NOT NULL,
  `pass` varchar(191) NOT NULL,
  `rule` varchar(191) NOT NULL,
  `address` varchar(300) NOT NULL,
  `phone` varchar(191) NOT NULL,
  `active` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `pass`, `rule`, `address`, `phone`, `active`) VALUES
(1, 'Wael Amri', 'wael@g.com', '29e615f2edb34f3a4058d269a03a9ade', 'manager', '', '', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `compounds`
--
ALTER TABLE `compounds`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `genders`
--
ALTER TABLE `genders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `levels`
--
ALTER TABLE `levels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `needs`
--
ALTER TABLE `needs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `paths`
--
ALTER TABLE `paths`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sections`
--
ALTER TABLE `sections`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `specs`
--
ALTER TABLE `specs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `subject_need`
--
ALTER TABLE `subject_need`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teachers`
--
ALTER TABLE `teachers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `compounds`
--
ALTER TABLE `compounds`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT for table `genders`
--
ALTER TABLE `genders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `levels`
--
ALTER TABLE `levels`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `needs`
--
ALTER TABLE `needs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- AUTO_INCREMENT for table `paths`
--
ALTER TABLE `paths`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `sections`
--
ALTER TABLE `sections`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `specs`
--
ALTER TABLE `specs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `subjects`
--
ALTER TABLE `subjects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `subject_need`
--
ALTER TABLE `subject_need`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `teachers`
--
ALTER TABLE `teachers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=126;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
